Utilizar o conjunto de dados Titanic.

Entregáveis:
* Conjunto de teste não utilizado no treinamento
* Análise dos resultados (porque escolheu esse modelo, como foi a avaliação, etc)
* Utilizar FastAPI para fazer o predict de cada amostra individualmente

Dicas:
* Realizar limpeza dos dados
* Realizar experimentos utilizando normalização, padronização e dados brutos
* Fazer categorização dos dados. Se fizer categorização, realizar experimentos utilizando OneHotEncoding
* Realizer experimentos selecionando atributos
* Utilizar técnicas de otimização de hiperparametros

In [2]:
import pandas as pd

In [3]:
df_test = pd.read_csv("datasets/test.csv")
df_train = pd.read_csv("datasets/train.csv")

In [4]:
df_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [5]:
df_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
df_test.Age

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [7]:
df_concat = pd.concat((df_train,df_test), axis=0)
df_concat

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [8]:
df_titanic_full = df_concat.values.tolist()
for i,v in enumerate(df_titanic_full):
    if v[5] <= 18:
        df_titanic_full[i][5] = "Criança"
    elif v[5] <= 65 and v[5] > 18:
        df_titanic_full[i][5] = "Adulto"
    elif v[5] > 65:
        df_titanic_full[i][5] = "Idoso"

In [9]:
df = pd.DataFrame(df_titanic_full,columns=['PassengerId','Survived','Pclass','Name','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked'])
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,Adulto,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,Adulto,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,Adulto,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,Adulto,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,Adulto,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,Adulto,0,0,PC 17758,108.9000,C105,C
1306,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,Adulto,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [10]:
values = {'Age' : df.Age.mode()[0], 'Cabin' : 'SC', 'Embarked' : 'S'}
print(values)

{'Age': 'Adulto', 'Cabin': 'SC', 'Embarked': 'S'}

In [11]:
df.fillna(value=values, inplace=True)
print(df.isnull().sum())

PassengerId      0
Survived       418
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin            0
Embarked         0
dtype: int64

In [17]:
df_titanic = pd.DataFrame(df, columns=['PassengerId','PClass','Name', 'Sex', 'Age'])
df_titanic

,PassengerId,PClass,Name,Sex,Age
0,1,NaN,"Braund, Mr. Owen Harris",male,Adulto
1,2,NaN,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,Adulto
2,3,NaN,"Heikkinen, Miss. Laina",female,Adulto
3,4,NaN,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,Adulto
4,5,NaN,"Allen, Mr. William Henry",male,Adulto
...,...,...,...,...,...
1304,1305,NaN,"Spector, Mr. Woolf",male,Adulto
1305,1306,NaN,"Oliva y Ocana, Dona. Fermina",female,Adulto
1306,1307,NaN,"Saether, Mr. Simon Sivertsen",male,Adulto
1307,1308,NaN,"Ware, Mr. Frederick",male,Adulto
1308,1309,NaN,"Peter, Master. Michael J",male,Adulto

In [13]:
df_titanic.Name = df_titanic.Name.str.rstrip()
df_titanic.Name = df_titanic.Name.str.lstrip()

In [14]:
df_titanic.Name = df_titanic.Name.str.upper()

In [15]:
df_titanic

,PassengerId,Name,Sex,Age,PClass
0,1,"BRAUND, MR. OWEN HARRIS",male,Adulto,NaN
1,2,"CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...",female,Adulto,NaN
2,3,"HEIKKINEN, MISS. LAINA",female,Adulto,NaN
3,4,"FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)",female,Adulto,NaN
4,5,"ALLEN, MR. WILLIAM HENRY",male,Adulto,NaN
...,...,...,...,...,...
1304,1305,"SPECTOR, MR. WOOLF",male,Adulto,NaN
1305,1306,"OLIVA Y OCANA, DONA. FERMINA",female,Adulto,NaN
1306,1307,"SAETHER, MR. SIMON SIVERTSEN",male,Adulto,NaN
1307,1308,"WARE, MR. FREDERICK",male,Adulto,NaN
1308,1309,"PETER, MASTER. MICHAEL J",male,Adulto,NaN